html/open-life-the-philosophy-of-open-source.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Open Life - The Philosophy of Open Source</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Open Life - The Philosophy of Open Source</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Part One: The French in crisis</a></li>
<li><a href="#sec-2">2. Part Two: Lessons learned in the world of Open Source</a>
<ul>
<li><a href="#sec-2-1">2.1. the deadliness of deadlines（如何看待deadlines)</a></li>
<li><a href="#sec-2-2">2.2. Work undone（没有完成的工作？论如何设定工作优先级）</a></li>
<li><a href="#sec-2-3">2.3. Don't plan anything（开放心态，拥抱变化）</a></li>
<li><a href="#sec-2-4">2.4. Do whatever you like（做你喜欢做的事情。做爱？）</a></li>
<li><a href="#sec-2-5">2.5. Laziness is a virtue（懒惰是美德）</a></li>
<li><a href="#sec-2-6">2.6. Benevolent Dictator（仁慈的独裁者。为什么这个模型可以实施）</a></li>
<li><a href="#sec-2-7">2.7. Tolerance（包容别人和自己）</a></li>
<li><a href="#sec-2-8">2.8. Diversity（多样性）</a></li>
<li><a href="#sec-2-9">2.9. Courange and Curiosity（勇气和好奇）</a></li>
<li><a href="#sec-2-10">2.10. Names and Identity（名字和身份，亦或是荣誉）</a></li>
<li><a href="#sec-2-11">2.11. What is ethics? （道德准则）</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Part Three: The business models of a hacker</a></li>
<li><a href="#sec-4">4. Part Four: Open Life</a></li>
</ul>
</div>
</div>
<p>
<a href="https://openlife.cc/online">https://openlife.cc/online</a>
</p>

<ul class="org-ul">
<li>Part One: The French in crisis: 为什么我们会有meanspirited（心胸狭窄），为什么开源运动避免了这种心理和行为
</li>
<li>Part Two: Lessons learned in the world of Open Source: 我们能从开源运动中学到什么东西（我觉得这节的信息量最大）
</li>
<li>Part Three: The bussiness models of a hacker: 开源运动使用的各种商业模式
</li>
<li>Part Four: Open Life: 开源运动是如何影响我们生活和社会的
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Part One: The French in crisis</h2>
<div class="outline-text-2" id="text-1">
<p>
所谓的mean-spiriedness是因为供需关系造成的：如果我会一个魔术，那么大家肯定对我的魔术非常感兴趣；
但是如果将这个魔术解密并且分享给大家的话，那么大家就都不喜欢了。所以为了保证某个东西卖的好，那么我们可能会减少这个东西的供给。
如果农场生产的葡萄过量了，但是为了维持葡萄酒的价格，我们也要将一些葡萄倒掉。
</p>

<p>
正是因为这种简单的市场供需关系(law of supply and demand)让我们每个人都刻意保守信息，因为一旦信息
分享给别人，那么这个信息就不值钱了。这就造成了我们所谓的meanspiried(心胸狭窄）。
</p>

<blockquote>
<p>
In addition to which, ‘we’ might ‘have a secret that we’re not telling
you!’ Children’s secrets can seem amusingly insignificant to adults, but
what a secret is about is not what matters – the important thing is that they
are not telling it to others! Adults carry this exact same model of operations
on into the world of trade secrets. Often, the kind of stuff branded a trade
secret can also be absurdly insignificant, but the important thing is that they
don’t tell others about it. Today’s companies are at least as interested in the
things they don’t do as the things they pretend to be doing and producing.
And the doings of such companies aren’t always any loftier than kids
playing in a sandbox. In the Finnish magazine Tietoviikko, a columnist once
wrote about his friend’s experiences at a new media company that has since
gone bankrupt. There, it was said, they generally spent more time writing
non-disclosure agreements than they did doing any real business. In
hindsight, the guy was quite happy about it. You really wouldn’t want
anybody to know about the kind of stuff that was going on inside the new
media bubble!
</p>

<p>
In the light of these observations, there’s an ominous sense that much of
what we do is done with a logic of mean-spiritedness, whether it is in
business or in our everyday lives! We handle our relationships with other
people the same way Arabs handle oil production: ‘After yesterday’s
meeting, OPEC announced that it won’t play with you anymore.’
</p>
</blockquote>

<p>
欧元区对农产品实施配额，政府会针对这个配额进行补贴。它们的逻辑是：如果农产品生产超过这个配额的话，那么我们很快就会面临危机。
</p>

<blockquote>
<p>
OK, so I don’t understand the EU farming policy, that’s OK. But I do
know there’s a lot of talk in the EU about quotas. There are quotas for milk,
quotas for eggs, and quotas for grains. When a farmer gets a certain subsidy
for his work, he also commits to not exceed his quota. Because, if farmers
did exceed their quotas we’d have more food than the citizens of the EU
could eat, and in no time we’d have the same crisis on our hands as the
Beaujolais winegrowers.
</p>
</blockquote>

<p>
但是开源社区对这种行为持相反态度，鼓励开放和分享
</p>

<blockquote>
<p>
The Open Source community is turning the practices of the IT industry
upside-down. And what is most encouraging about this is that in practice
Open Source code seems to be proving that mean-spiritedness is the worse
option – openness is better. Could that also mean that music is more
beautiful when played and that jokes are funnier when told? Can we learn to
identify and eliminate the logic of mean-spiritedness wherever it’s at work
in other areas of life, so that along with open code, we can also have an
open mind and live a more open and generous life?
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Part Two: Lessons learned in the world of Open Source</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> the deadliness of deadlines（如何看待deadlines)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
features, quality, deadline 是一个项目三个最重要的方面。就像CAP一样，我们只能做好其中两个。
</p>
<blockquote>
<p>
In his legendary essay ‘The Cathedral and the Bazaar’, Eric Raymond
discusses this principle.9 He comes to the conclusion that in a programming
project, as in any project, there are typically three expectations: the finished
product must have certain features; it must meet certain demands of quality;
and it must be completed by a fixed deadline.
</p>

<p>
These three demands – features, quality, and deadline – would build a
certain tension into any project. If, for instance, the schedule is too tight,
there may not be enough time to include all the features you want. But if a
project manager leans on his team, demanding that all the features are
included and the deadline be met, then they are compelled to do a rushed
job and, inevitably, quality suffers. Raymond concludes that by consciously
abandoning just one of the demands, you can usually achieve good results
on the other two.
</p>
</blockquote>

<p>
大多数的dealines设定都是很随意或者是很官僚的，所以真的有必要让这些deadlines让我们喘不过气吗？
</p>

<blockquote>
<p>
Quality and quantity of features are factors of the corporate world and of
production. Perhaps some project manager will employ Eric Raymond’s
way of thinking in their next project. But more important is to understand
the influence of deadlines on our own lives. To many people a deadline can
seem like a matter of actual life or death, and they feel impelled to work like
crazy late into the night to meet it. And very often this life-or-death deadline
is totally arbitrary or – as in my own case – is fixed to comply with some
utterly unproductive bureaucratic detail. And for that we allow ourselves to
become so stressed?
</p>
</blockquote>

<p>
如果我们工作是为了快乐的话，那么我们真的没有必要去满足这些人为设计的deadlines.
如果满足这些人为设计或者是某些毫无意义的deadlines, 让我们工作不快乐的话，那又有什么意义呢？
</p>

<blockquote>
<p>
Since we work to have fun, to enjoy it, then why do we drive ourselves
into the ground trying to meet artificial deadlines? Why work like drudges,
as if it really is a question of life and death? Linus feels there’s no sensible
reason for it. You ought to enjoy work, because that’s why you do it. Once
again, it’s clear that deadlines are bad for both the worker and the work itself.
</p>
</blockquote>
</div>
</div>
