src/open-life-the-philosophy-of-open-source.org
*** Work undone（没有完成的工作？论如何设定工作优先级）

这个世界上抱怨的人比实际做事情的人要多得多，他们的各种点子也是层出不穷。更要命的是，
当你真的去实现这些点子或者是解决他们问题的时候，他们根本就不关心。并且当可怜的程序员
不断地区满足这些人要求的时候，也预示这个项目就快要黄了（因为它没有解决真实用户的真正问题）。

#+BEGIN_QUOTE
Unfortunately, one also has to accept that there are a large number of
people whose mission in life is to complain. For Linus, who was all excited
about making a working operating system for himself, mixed in with the
plaudits came the complaints, ‘Linux doesn’t have so and so,’ and ‘Linux
can’t do this or that.’ Such people are never satisfied. And alongside them
come the propeller heads wanting their ideas to be incorporated: ‘I’ve been
thinking you could add such and such a feature to Linux ...’ But even if the
feature they’d suggested was added to the program, they’d never use it,
because by then they’d already have had ten other new ideas about what ‘it
would be so cool if you were to …’ The poor programmer would like to
make all these Little Helpers happy, but if he tried, he’d find himself
swamped by a never-ending stream of requests. What’s worse is that too
much popularity of this kind can be the death of a project that had got off to
a good start.
#+END_QUOTE

如果这些人真的在意他们需求的话，那么他们肯定会找到办法来解决的。毕竟代码是开放的，也没有人
有任何理由去阻止你获得和修改这些代码。

#+BEGIN_QUOTE
With this in mind, a program developer’s curt reply should be
interpreted as a polite negative, a necessarily shortened version of, ‘Because
I work on this program as a hobby and for my own enjoyment, I
unfortunately lack the time to realize the feature you suggest, and for which
I myself have no need. However, I do think your idea is good and, if you
want, you can realize it yourself because the code is freely available on the
Internet. Working together is fun, too.’

In addition to self-preservation, there is another little seed of truth in the
short answer. After all, if the person asking really needed the feature they’d
mentioned, they could create it for themself or at least hire someone who
could do it for them. Of course, many of these people are truly excited about
their good ideas, but when put to them like this, they become considerably
less excited. In reality, they don’t believe enough in their great idea to invest
more than a few seconds of their time chatting about it, or to invest a penny
of their money.
#+END_QUOTE

所以如果某个工作长久没有进展，那么很可能是因为真的没有人需要它。如果它真的很重要的话，那么它自己就会出现的。
#+BEGIN_QUOTE
With everybody doing whatever they feel like, some things often stay
undone for a long time, simply because they’re things nobody feels like
doing. This gives Linus no cause for concern. If some feature remains
unrealized for years, it can’t be all that important, as people have been
getting along without it! What Linus teaches us here is that the important
stuff will automatically get selected and done, so it need not be worried about.
#+END_QUOTE

所以如果老板和你说：这个项目很重要，需要你加班节点完成的话。那么你可以告诉你自己，
如果他真的在乎这个项目的话，那么他一定会雇佣很多人，而不用让我自己一个人加班节点完成。
#+BEGIN_QUOTE
Even if you don’t happen to have a billion dollars, you can still apply
this principle of the Open Source community in your own life. Next time
your boss offers you a really important new project that must be done
immediately, you can think: If this project is really so important to the
company, I’m sure they can hire somebody to do it who won’t have to do it
as overtime.
#+END_QUOTE

*** Don't plan anything（开放心态，拥抱变化）
我觉得与其说是不要做计划，不如说是拥抱变化。

#+BEGIN_QUOTE
Linus undeniably a great man in the field of computer programming
is someone who doesn't fit the mould of these spirit-lifting talks. It seems
that the guiding principles at work in the development of Linux have been
the lack of vision and determination, or something we might prefer to call
openness. Openness to other people's ideas. Openness to changes in plans.
#+END_QUOTE

*** Do whatever you like（做你喜欢做的事情。做爱？）

当人们问Linus自己如何能参与到Linux中来，他的回答总是“找到你感兴趣的部分，然后参与进来”。
他的回答非常明智：他知道每个人的喜欢是不同的，他也知道不能帮助其他人做决定，然后他也清楚
兴趣对一个人持续投入的重要性。

对于大型项目，或者说对于混乱的人生，想想自己应该做点什么事情呢？求助于别人通常是无效的，不如想想自己喜欢做点什么。

#+BEGIN_QUOTE
One consequence of this fashion fad was that people started contacting
Linus because they wanted to get involved in developing Linux. When they
sought his advice about what they should start doing, he came up with
another curt answer: Figure out what you're interested in, then join in by
doing that.

Linus knew why he gave such non-specific answers. If he arbitrarily
suggested that people get involved with this or that project, possibly
something currently fascinating to himself, his advice was bound to prove
inappropriate for the other person. For one thing, the person seeking advice
would probably not be interested in the same things as Linus, and would
have a different range of abilities. So, anyone who was given specific advice
would probably soon get frustrated with the whole project and end up being
angry with both Linus and Linux. Also, no project can benefit greatly from
a volunteer who isn't really keen on their part of the work.
#+END_QUOTE

*** Laziness is a virtue（懒惰是美德）

懒惰的程序员希望事情可以被更加有效地完成，结果导致这些程序员需要编写更多的代码。
这个陈述有点夸张，更准确的说希望事情可以自动化，做事情效率可以更高。

#+BEGIN_QUOTE
The logic of the claim goes like this: the lazier the programmer, the
more code he writes. When a programmer hits a boring, time-consuming
and high-on-routines task, he gets lazy. There is nothing worse for a lazy
hacker than boring routine tasks. That’s why he decides to write a program
that will do the routine tasks for him. This is the program he sits up all night
to perfect, seemingly diligently at work. Typing is too arduous for him, so
he writes the code for a word processing program. And because it’s too
much effort to print out a letter and take it to the postbox, not to mention
licking a stamp, he writes the code for e-mail. Now you’ll understand how
truly lazy programmers are.
#+END_QUOTE

下面是对“如果效率提高了，那大家不就都没事情做了”这种论点的一个讽刺例子
#+BEGIN_QUOTE
So, laziness is a programmer’s prime virtue. It’s good to remember this
contradictory and somewhat amusing claim, because it’s all too easy to
forget why computers and computer programs – along with all other
technology – were originally invented.

A new nuclear power plant is currently being built in Finland. Before the
decision was made to build it, there was lively debate for and against
nuclear power. One Member of Parliament who debated the question
suggested that more nuclear power would be bad for Finland because the
other ways of producing energy employed more people. Now, I must
emphasize that I think there are many good reasons not to build more
nuclear power plants in the world, but this was the most ridiculous argument
I’ve ever heard, and I retain the right to laugh in the face of such an absurd
argument.

Naturally, you could actually produce electricity by having all the
unemployed people in Finland pedal exercise bikes hooked up to dynamos,
which in turn would be hooked into the power grid. That would probably
give enough energy to light a fair-sized village, not to mention the added
benefit of guaranteeing employment for everybody. But you’d be crazy to
do it that way.
#+END_QUOTE

