src/open-life-the-philosophy-of-open-source.org
*** Benevolent Dictator（仁慈的独裁者。为什么这个模型可以实施）

西方对于专制持怀疑态度，是因为他们的历史上出现过许多因为专制带来灾难的事情。
所以即使考虑到了因为协商和妥协带来的成本和低效率问题，他们还是选择了民主。

#+BEGIN_QUOTE
For those of us living in Western democracies, talk of dictatorship could
sound suspicious. Although the directness of a dictatorship is sure to be
cost-effective and helps to create a light organizational structure, history has
taught us something about the problems inherent in such a system. Alas, few
monarchs or dictators have ever been known for their benevolence. So,
despite the cost, inefficiency and frustration caused by the negotiations,
compromises and voting in a democracy, we have learnt the lessons of
history and chosen to live under a democratic system of government
#+END_QUOTE

独裁者在软件架构中是需要的，因为这样才能让架构统一。所谓仁慈的独裁者是这个独裁者不能太笨，
没有办法做出好的决策。并且独裁者可以很容易地被更换，因为大家可以快速地fork代码然后在其他地方
选出另外一位BD.

#+BEGIN_QUOTE
The principles of Open Source generate a curious dynamic, which
directly influences the hierarchy of the project organization and the
relationships of its members. What would happen if for some reason Linus
decided to screw things up and out of spite started making stupid decisions
for Linux? Within twenty-four hours the other Linux developers would
leave him to fool around on his own, make a copy of the Linux source code
somewhere Linus couldn't get his hands on it and keep working without
him. It's also extremely likely that the hackers involved would quickly elect
more or less consciously and more or less democratically a new
benevolent dictator.

All that is possible because the code itself is open and freely available
for anyone to use. As dictator, Linus has all the authority while at the same
time having no power whatsoever. The others see him as their leader only
because he is so talented or benevolent. There is a fascinating equilibrium
of power and freedom. The dictator has the power and the others have the
freedom to vote with their feet.
#+END_QUOTE

所以BD模型依赖于什么？依赖于这个组织/项目的Openness.
#+BEGIN_QUOTE
Such situations lack the openness that is inseparable from the Open Source
process. Without openness there can't be complete trust in other members of
the organization; instead, we are stuck with having to use the unwieldy
processes of democracy to protect ourselves against power struggles and a
variety of other forms of mean-spiritedness. Openness is so integral to the
system of an Open Source project that such precautionary measures aren蒸
necessary.
#+END_QUOTE

这个独裁者身边还有很多小的独裁者，所以这种独裁是一种精英领导体制。但是不管怎么说，
大家相信这种精英的能力和判断，并且大家可以随时决定不带你玩（话虽如此，但是从真实的历史来看，
这种乌合之众造反还能成功的例子，真的是没有）。

#+BEGIN_QUOTE
As at the W3C, decisions regarding the development of Linux are
usually made after thorough discussion. Linus in particular takes the advice
of his closest and longer-term colleagues, who within the community are
known as his lieutenants. These lieutenants are like mini-dictators, and each
one has their own area of responsibility within the project. Just as for Linus,
their authority is based on talent proven over a period of years and the trust
that it has generated. The dictatorship is therefore a meritocracy.

There have also been instances where, despite Linus being against a
particular solution, he has grudgingly had to accept what is wanted by the
majority. If he didn't, one day he might not be the dictator anymore. The
open system works lightly, but is nonetheless democratic.
#+END_QUOTE

*** Tolerance（包容别人和自己）

对待MS的包容性让Linux发展更加健康。如果你所有的行动是建立在对别人威胁的回击之上的话，
那么你就会陷入恶性循环，而没有办法做好自己的事情。下面谈到了苏联解体之后美国间谍的事情。

#+BEGIN_QUOTE
More than anything, however, Linus Torvalds tolerant attitude makes
sense for the sake of his own mental health. It's not healthy for one's central
motivation to be hatred and fear. And, what if one day Linux did manage to
bring down Microsoft? Would life then lose its meaning? In order to
energize themselves, would the programmers then have to find some new
and fearful threat to compete against?

People whose actions stem from this idea of having to outdo some
perceived threat usually end up in just such a vicious circle. Take the US
Army, for instance. You'd have thought that the fall of the Soviet Union
would have been a happy day for American soldiers and CIA spies. It was
no such thing. Far from it! All it meant to them was looming unemployment.
They therefore needed to conjure up a new threat somewhere and find it
fast. First they tried painting dark clouds in the shape of international drug
dealing. For some reason that didn't quite have the cachet of an enemy
nuclear state, so they had to look elsewhere. Now they're finally got their
ideal enemy. Terrorists. They are apparently everywhere, but can’t be found.
That means there’s plenty of work to be done in defending the nation, the
money keeps coming in, and motivation is high. Again, the United States of
America is a force to be reckoned with.
#+END_QUOTE

学会容忍能让自己生活更好，无论如何，bugs是修复不完的。开心专注地做好自己能做的事情就对了。

#+BEGIN_QUOTE
To me, Linus Torvalds example of tolerance shows great insight. As a
talented programmer he cannot accept programs with bugs on his own
computer, but their existence as such does not bother him. He can do a better
job of writing code himself and is happy with the work he does. At the same
time, it wouldn't bother him at all if everybody else wanted to use Windows
instead of Linux. After all, that's not his problem. In a world of power
struggles and perceived threats, Linus's tolerant attitude is breath of fresh air
and an open source of peace of mind for everyone.
#+END_QUOTE

*** Diversity（多样性）

多样性我认为是“do whatever you like"和"tolerance"的必然结果。

#+BEGIN_QUOTE
However, despite all the problems I've mentioned, the Open Source
community is unanimous in feeling that the diversity available in Linux
even though it is sometimes inefficient is valuable. We must always return
to the guiding principles of Open Source, as discussed earlier in this book.
Programmers do whatever they like to do what excites them. If someone
wants to make GNOME software, who's to stop them? And who loses if
someone makes GNOME programs, even when everyone else wants to use
KDE programs? These principles inevitably lead to diversity, because the
Open Source community is not Soviet Russia, where everybody must follow
whatever five-year plan is currently in force.
#+END_QUOTE

多样性除了可以利于竞争之外，从整体上看还减少了因为“孤独一掷”造成的巨大风险。

#+BEGIN_QUOTE
There are also benefits to be gained when different projects compete
with one another. The making of graphical user interfaces is a relatively
young science, and nobody really knows which is the one and only right
way of getting things done. Competing projects may come up with
different solutions to the same problem, and not until later does it become
clear which of them provided the wiser and smoother solution. Thus, the
existence of two separate projects lessens the risk of the GUI world of Linux
ending up in a technological cul-de-sac（死胡同）.
#+END_QUOTE

