src/open-life-the-philosophy-of-open-source.org
*** Courange and Curiosity（勇气和好奇）
面对美女也要像面对计算机一样，充满好奇，敢于尝试。

#+BEGIN_QUOTE
If the beauty were a computer, the nerd would behave differently –
courageously. With the beauty sitting opposite there would come a moment
of truth – time for a smoke test! The nerd would say something, despite the
high likelihood of getting a chilling puff of smoke in the face. It’s not as if
this nerd hasn’t had his share of failed smoke tests with computer programs,
and they have never slowed him down. Actually, the nerd doesn’t even see
such failures as failures. They are just different experiments and just as
much fun and educational as the successful tests. And it’s only through
failed smoke tests that you finally get to the ones that don’t fail.

Had the nerd applied this same logic to approaching the woman, he’d
have spoken to her right from the start. Her reaction would either have been
positive or negative. But as far as the nerd is concerned, both reactions are
useful and productive, because they immediately satisfy his curiosity and
desire to try new things. Not even a rebuff means failure for the nerd; it’s
just a smoke test and whatever the result you are then free to go on and try
something else.
#+END_QUOTE

*** Names and Identity（名字和身份，亦或是荣誉）
*** What is ethics? （道德准则）

Mad cow disease – or bovine spongiform encephalopathy (BSE) – was
caused by feeding cows a mixture of meal made from the brains and bones
of dead cows and sheep. I don’t know what’s wrong with European farming,
but here we go again! Since good brains were going to waste, somebody
thought it would be a good idea to feed them back to the cows and save the
money farmers would otherwise spend on real feed. A few years later we
had mad cow disease and tens of Europeans dead as a result of eating the
beef from these cows.

Although Finland was spared this epidemic, which mostly devastated the
British farming industry, the crisis was widely discussed here. On a TV chat
show, a farmer from the north said that in the early nineties feed which had
included brain matter had been offered to farmers in Finland. However,
Finnish farmers considered that having cows grow fat on the offal from
other cows was completely unethical and they refused to buy the feed.

So, in northern Finland we had a farmer who spoke of what is ethical.
Today, the infamous ‘meat-and-bone meal’ is banned throughout Europe.
Yet, ten years earlier, farmers in Finland had refused to use it because they
didn’t think it was ethical! And since the meat-and-bone meal had not been
used here, Finland was spared mad cow disease and the tragic consequences
that followed it in other parts of Europe.

** Part Three: The business models of a hacker

原来Debian是这么地强大

#+BEGIN_QUOTE
For anyone who measures their Linux by the number of programs that
come with it, Debian includes 8,710 different software programs, which is
by far the biggest. And all this can be installed for free by downloading it
from the Internet or alternatively from CDs that cost around €8 from
DataClub. Imagine, 8,710 different programs, all nicely bundled up in an
easily installable and working package.

The other Linux versions are usually only available for computers that
have Intel’s so-called x86 architecture and in some instances some other
architectures, such as the PowerPC (Apple computers) or IA-64 (Intel’s new
64 bit architecture) or AMD’s Opteron. At least Red Hat and SuSE support
IBM’s mainframe architectures in addition to these. But Debian is in a
league of its own. It works on eleven different architectures!
#+END_QUOTE

以稳定性著称的Debian

#+BEGIN_QUOTE
Debian has by its mere existence balanced the Linux world, by offering
a free alternative to the commercial Linux brands. Where most Linux
companies release new versions of their Linuxes as often as twice a year,
Debian can let up to two years pass without releasing a new version.
Perhaps more than any of the other Linuxes, Debian has kept to the principle
of releasing a product only ‘when it’s ready’. By the time Debian finally
releases a new version, many of the programs included in it are already
relatively old, because Debian observes a very conservative testing and
quality control policy. In part, the delay also reflects the Debian principle of
releasing for all eleven different architectures at the same time. Most other
Linux distributions release the version for each of the architectures as they
get them done.
#+END_QUOTE

** Part Four: Open Life

关于Gutenberg（古腾堡）计划创始人Michael Hart对计算机未来价值的看法：存储而非计算力才是未来最大的价值。

#+BEGIN_QUOTE
However, Michael Hart didn’t want to get involved in such projects, and
tried to come up with something else to do with his computer time. After all,
at the time this was a resource that would have cost $100 million to buy!
You couldn’t exactly leave it unused.

Having thought about it for an hour and 47 minutes – so it is said –
Michael Hart predicted that the greatest future value of computers would not
be their calculating capabilities, but in storing information and in the
unlimited distribution and search for information. Not a bad guess! Thus
began Project Gutenberg, and the first information stored by Michael was
the US Declaration of Independence, which being a public document was
common property; that is, in the public domain.

The Declaration of Independence may not qualify for a place in the top
ten of Western literature – particularly for non-Americans like myself – but
it was more than nationalistic pride that made Michael Hart choose that
particular text. There were actually some very practical concerns: it was
suitably short, which meant it would fit it on the disks available in 1971.
The time for storing the whole of Moby Dick and the Bible came later, as the
technology developed.
#+END_QUOTE
